{
    "tutorial":{
       "order":1,
       "_id":"61f806f8c1f05e3d45b73576",
       "imagePath":"",
       "draft":false,
       "displayText":[
          {
             "language":"en",
             "text":"New tutorial"
          },
          {
             "language":"de",
             "text":"Neue Anleitung"
          }
       ],
       "owner":"5ff81b0d22705e3c45e77064",
       "steps":[
          {
             "imagePath":"",
             "stepId":1,
             "displayText":[
                {
                   "language":"en",
                   "text":"Tutorials are a great way to communicate complex tasks or processes by breaking them down into easy-to-follow steps."
                },
                {
                   "language":"de",
                   "text":"Anleitungen sind eine gute Möglichkeit, komplexe Aufgaben oder Prozesse zu vermitteln, indem sie in leicht nachvollziehbare Schritte unterteilt werden."
                }
             ],
             "description": "Description-1",
             "documentReference":""
          },
          {
             "imagePath":"",
             "stepId":2,
             "displayText":[
                {
                   "language":"en",
                   "text":"Simply type in the instructions in the text boxes. You can rearrange steps easily by using drag and drop, or use the button underneath to add new ones."
                },
                {
                   "language":"de",
                   "text":"Geben Sie die Instruktionen einfach in die Textfelder ein. Sie können die Schritte einfach per Drag & Drop neu anordnen oder mit der unteren Schaltfläche neue Schritte hinzufügen."
                }
             ],
             "description": "Description-2",
             "documentReference":""
          },
          {
             "imagePath":"",
             "stepId":3,
             "displayText":[
                {
                   "language":"en",
                   "text":"You can add images, GIFs or videos to illustrate each step. Remember: an image is worth more than a thousand words!"
                },
                {
                   "language":"de",
                   "text":"Sie können Bilder, GIFs oder Videos zur Veranschaulichung der einzelnen Schritte hinzufügen. Denken Sie daran: Ein Bild sagt mehr als tausend Worte!"
                }
             ],
             "description": "Description-3",
             "documentReference":""
          },
          {
             "imagePath":"",
             "stepId":4,
             "displayText":[
                {
                   "language":"en",
                   "text":"Whenever you save your changes, they are immediately available to personnel on the field worldwide."
                },
                {
                   "language":"de",
                   "text":"Sobald Sie Ihre Änderungen speichern, steht die neue Version den Mitarbeitern  weltweit sofort zur Verfügung."
                }
             ],
             "description": "Description-4",
             "documentReference":""
          }
       ],
       "__v":0
    }
 }